In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

/home/muhammadqasim/anaconda3/lib/python3.7/importlib/_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)

In [4]:
s1 = pd.Series([1,3,3,4])
s2 = pd.Series([1,3,4,3], index=['a','b','c','d'])
s3 = pd.Series([1,2,3,4], index=['a','b','c','d'], name='s3')
s3.index.name='abc'
s3

abc
a    1
b    2
c    3
d    4
Name: s3, dtype: int64

In [7]:
s4={"a":1,"b":2,"c":3}
s4 = pd.Series(s4, name='abc')
s4

a    1
b    2
c    3
Name: abc, dtype: int64

In [10]:
s5 = pd.Series((1,3,5, np.nan))
s5

0    1.0
1    3.0
2    5.0
3    NaN
dtype: float64

In [13]:
print(pd.isnull(s5), pd.notnull(s5), sep='\n')

0    False
1    False
2    False
3     True
dtype: bool
0     True
1     True
2     True
3    False
dtype: bool

# Data Frame

In [14]:
d1 = {'c1':[1,2,3],
     'c2':['a','b','c'],
     'c3':['x','z','y']}
df1 = pd.DataFrame(d1)
df1

   c1 c2 c3
0   1  a  x
1   2  b  z
2   3  c  y

In [15]:
d1 = {'c1':[1,2,3],
     'c2':['a','b','c'],
     'c3':['x','z','y']}
df1 = pd.DataFrame(d1, columns=['c1','c3','c2'])
df1

   c1 c3 c2
0   1  x  a
1   2  z  b
2   3  y  c

In [16]:
d1 = {'c1':[1,2,3],
     'c2':['a','b','c'],
     'c3':['x','z','y']}
df1 = pd.DataFrame(d1, columns=['c1','c3','c2'], index=['A',"B","C"])
df1

   c1 c3 c2
A   1  x  a
B   2  z  b
C   3  y  c

In [19]:
print(df1.index)
print(df1.columns)

Index(['A', 'B', 'C'], dtype='object')
Index(['c1', 'c3', 'c2'], dtype='object')

In [21]:
df1.c1

A    1
B    2
C    3
Name: c1, dtype: int64

In [22]:
df1['c1']

A    1
B    2
C    3
Name: c1, dtype: int64

In [24]:
df1.loc[:,['c2']]

  c2
A  a
B  b
C  c

In [30]:
s1 = pd.Series(['A','B','C'])
s1

0    A
1    B
2    C
dtype: object

In [32]:
s1.reindex(np.arange(6))

0      A
1      B
2      C
3    NaN
4    NaN
5    NaN
dtype: object

In [33]:
s1.reindex(np.arange(6), method='ffill')

0    A
1    B
2    C
3    C
4    C
5    C
dtype: object

In [34]:
s1.reindex(np.arange(6), method='bfill')

0      A
1      B
2      C
3    NaN
4    NaN
5    NaN
dtype: object

In [37]:
s1.reindex(np.arange(6), fill_value=5)

0    A
1    B
2    C
3    5
4    5
5    5
dtype: object

In [46]:
s1.reindex(np.arange(9), method='ffill',limit=3)

0      A
1      B
2      C
3      C
4      C
5      C
6    NaN
7    NaN
8    NaN
dtype: object

In [83]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz','foo', 'foo', 'qux', 'qux'],
                   ['one', 'two', 'one', 'two','one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [90]:
pd.DataFrame(np.random.randn(3,3), columns=[['A','A','B'],['A',"B",'C']])

          A                   B
          A         B         C
0 -0.400018  1.189120  0.770913
1 -0.273820  1.420349 -1.204348
2  0.538370  0.514976 -0.422507

In [86]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=[['A','A'],['A', 'B']])
df

                     A
                     A         B
first second
bar   one     1.506188  2.067395
      two    -0.199173 -0.443828
baz   one    -0.067057 -1.121064
      two     0.055232  1.107920
foo   one    -0.596962 -0.788287
      two     1.148132 -0.387027
qux   one    -0.371004 -0.729573
      two    -0.822205 -0.248007